<?php

namespace Backend\Library\Parsers\Teplo3000\Adapter;

use Backend\Library\Parsers\Teplo3000\Adapter\TDO\AttributeValue;
use Backend\Library\Parsers\Teplo3000\Adapter\TDO\Switcher;
use Backend\Library\Parsers\Teplo3000\Adapter\TDO\SwitchValue;


return [
    'Гарантия' => new AttributeValue(2),
    'Страна-производитель' => new AttributeValue(null, [
        'Чехия' => 5,
        'Турция' => 4,
        'Россия' => 3,
        'Италия' => 6,
        'Германия' => 7,
        'Южная Корея' => 9,
        'Португалия' => 10,
        'Финляндия' => 11,
        'Бельгия' => 12,
        'Польша' => 13,
        'Швеция' => 14,
        'Беларусь' => 15,
        'Франция' => 16,
        'Китай' => 17,
        'Норвегия' => 18,
        'Венгрия' => 19,
        'Испания' => 21,
        'Дания' => 20,
        'Нидерланды' => 772,
    ]),
    'Производитель' => new AttributeValue(null, [
        'Buderus' => 24,
        'Baxi' => 25,
        'Эван' => 26,
        'Bosch' => 27,
        'Protherm' => 28,
        'Fondital' => 29,
        'Navien' => 30,
        'Ariston' => 31,
        'Vaillant' => 32,
        'Stout' => 33,
        'Viessmann' => 34,
        'Бастион' => 35,
        'Viadrus' => 36,
        'Kiturami' => 37,
        'Буржуй-К' => 38,
        'Теплодар' => 39,
        'Zota' => 40,
        'Thermex' => 41,
        'Северянин' => 42,
        'Jaspi' => 43,
        'ACV' => 44,
        'Kospel' => 45,
        'NIBE' => 46,
        'Hansa' => 47,
        'Neptun' => 48,
        'Thermagent' => 49,
        'AquaTech' => 50,
        'Dixis' => 52,
        'Unipump' => 51,
        'Reflex' => 53,
        'Itap' => 54,
        'Uponor' => 55,
        'Huch EnTEC' => 56,
        'Wester' => 57,
        'Meibes' => 58,
        'S-Tank' => 59,
        'Изотерм' => 60,
        'Barberi' => 61,
        'Oventrop' => 62,
        'ЭкоПром' => 63,
        'Rommer' => 64,
        'Leoch' => 65,
        'Теплофорум' => 66,
        'WBR' => 67,
        'Esbe' => 68,
        'Flamco' => 69,
        'Global' => 70,
        'Purmo' => 71,
        'Kermi' => 72,
        'Rifar' => 73,
        'Лидея' => 74,
        'Konner' => 75,
        'Royal Thermo' => 76,
        'Radolit' => 77,
        'Cordivari' => 78,
        'Stelrad' => 79,
        'Zehnder' => 80,
        'Arbonia' => 81,
        'Drazice' => 82,
        'OSO' => 83,
        'Superlux' => 84,
        'Atmor' => 85,
        'Gorenje' => 86,
        'Termica' => 87,
        'Watts' => 112,
        'Энергофлекс' => 138,
        'Thermo' => 143,
        'Теплолюкс' => 134,
        'Ensto' => 136,
        'Национальный комфорт' => 144,
        'Green Box' => 145,
        //   'Warmstad' =>,
        'Тепломаш' => 146,
        'Ballu' => 147,
        'Reventon' => 148,
        'Grundfos' => 88,
        'Wilo' => 89,
        'Pumpman' => 90,
        'SFA' => 91,
        'DAB' => 92,
        'Джилекс' => 93,
        'SBM-Group' => 94,
        'Henco' => 95,
        'Pro Aqua' => 96,
        'KAN-therm' => 97,
        'Wieland' => 98,
        'Ekoplastik' => 99,
        'Kofulso' => 100,
        'Frankische' => 101,
        'APE' => 102,
        'Sanha' => 103,
        'ТВЭЛ ПЭКС' => 104,
        'Ostendorf' => 105,
        'Хемкор' => 106,
        'Политрон' => 107,
        'Polytron-ProKan' => 108,
        'ГАЛЛОП' => 109,
        'Emmeti' => 110,
        'Tiemme' => 111,
        'Danfoss' => 113,
        'Luxor' => 114,
        'Herz' => 115,
        'Naval' => 116,
        'IMI TA' => 117,
        'IMI Heimeier' => 118,
        'Duco' => 119,
        'Tecofi' => 120,
        'Brennen' => 121,
        'ЭКО НОМ' => 122,
        'Micro Line TECHNOLOGIES' => 123,
        'IMIT' => 124,
        'Salus' => 125,
        'CAEM' => 126,
        'Campini' => 127,
        'Fantini Cosmi' => 128,
        'Cewal' => 129,
        'Норма ИС' => 130,
        'TECH' => 131,
        'XLayder' => 132,
        'Perry' => 133,
        'Freezstop' => 135,
        'ЗМК' => 137,
        'Profixings' => 139,
        'Unipak' => 140,
        'Felder' => 141,
        'Viega' => 142,
    ]),
    'Вид используемого топлива' => new AttributeValue(null, [
        'газовые' => 149,
        'электрические' => 150,
        'со сменными горелками' => 151,
        'твердотопливные' => 152,
        'дизельные' => 153,
        'комбинированные' => 154,
    ]),
    'Количество контуров' => new AttributeValue(null, [
        'двухконтурные (встроенный теплообменник ГВС)' => 155,
        'одноконтурные (без встроенного теплообменника ГВС)' => 156,
    ]),
    'Место монтажа' => new AttributeValue(null, [
        'настенные' => 157,
        'напольные' => 158,
    ]),
    'Особые виды газовых котлов' => new AttributeValue(null, [
        'традиционные' => 159,
    ]),
    'Материал теплообменника' => new AttributeValue(null, [
        'медь' => 160,
        'стальные' => 161,
        'чугунные' => 162,
        'алюминиевый сплав' => 163,
        'нержавеющая сталь' => 164,
        'силумин' => 165,
    ]),
    'Вид камеры сгорания' => new AttributeValue(null, [
        'закрытая камера' => 166,
        'открытая камера' => 167,
    ]),
    'КПД' => new AttributeValue(168, null, function ($value) {
        return str_replace([',', ' ', '%'], ['.', '', ''], $value);
    }),
    'Вид топлива' => new AttributeValue(773),
    'Допустимое рабочее давление теплоносителя' => new AttributeValue(209, null, function ($value) {
        return str_replace([',', ' ', 'бар'], ['.', '', ''], $value);
    }),
    'Допустимая температура подачи' => new AttributeValue(210, null, function ($value) {
        return str_replace(['°', ' ', ','], ['', '', '.'], $value);
    }),
    'Мощность' => new AttributeValue(211, null, function ($value) {
        return str_replace(['кВт', ' ', ','], ['', '', '.'], $value);
    }),
    'Патрубок дымохода' => new AttributeValue(null, [
        '60/100 мм' => 212,
        '130 мм' => 213,
        '80/125 мм' => 214,
        '110/160 мм' => 215,
        '75/75 мм' => 216,
        '135 мм' => 217,
        '110 мм' => 218,
        '150 мм' => 219,
        '156 мм' => 220,
        '176 мм' => 221,
        '20 мм' => 222,
        '136 мм' => 223,
        '155 мм' => 224,
        '180 мм' => 225,
        '120 мм' => 226,
        '100/150 мм' => 227,
        '225 мм' => 229,
        '250 мм' => 230,
        '200 мм' => 228,
        '80 мм' => 232,
        '114 мм' => 231,
        '115 мм' => 233,
        '220 мм' => 234,
        '75 мм' => 235,
        '140 мм' => 236,
        '160 мм' => 237,
        '255/125 мм' => 238,
        '102 мм' => 239,
        '255/100 мм' => 240,
        '120/200 мм' => 241,
        '210/95 мм' => 242,
        '100 мм' => 243,
        '159 мм' => 244,
        '128 мм' => 245,
        '178 мм' => 246,
        '300 мм' => 247,
        '148 мм' => 248,
        '360 мм' => 249,
        '132 мм' => 251,
        '142 мм' => 250,
        '182 мм' => 252,
        '80/100 мм' => 253,
        '125 мм' => 254,
        '195 мм' => 255,
        '350 мм' => 256,
        '400 мм' => 257,
        '500 мм' => 258,
    ]),
    'Расход сжиженного газа' => new AttributeValue(259, null, function ($value) {
        return str_replace(['кг/ч', ' ', ','], ['', '', '.'], $value);
    }),
    'Расход природного газа' => new AttributeValue(260, null, function ($value) {
        return str_replace(['м³/ч', ' ', ','], ['', '', '.'], $value);
    }),
    'Производительность горячей воды' => new AttributeValue(261, null, function ($value) {
        return str_replace(['л/мин', ' ', ','], ['', '', '.'], $value);
    }),
    'Вес' => new AttributeValue(262, null, function ($value) {
        return str_replace(['кг', ' ', ','], ['', '', '.'], $value);
    }),
    'Количество ступеней мощности' => new AttributeValue(null, [
        '4' => 266,
        '3' => 267,
        '2' => 268,
        '9' => 269,
        '12' => 270,
        '6' => 271,
        '1' => 272,
        '7' => 273,
        '5' => 274,
        '15' => 275,
        '30' => 276,
    ]),
    'Напряжение' => new AttributeValue(null, [
        '400/230 В' => 277,
        '220/380 В' => 278,
        '380 В' => 279,
        '220 В' => 280,
        '220, 380 В' => 281,
        '220±22/380±38 В' => 283,
        '380±38 В' => 284,
        '400 В' => 282,
        '380 (220) ± 10% В' => 285,
        '380 ± 10% В' => 286,
        '230 В' => 287,
        '220/400 В' => 288,
        '230/400 В' => 289,
        '200 В' => 290,
        '240 В' => 291,
        '220/230 В' => 292,
    ]),
    'Особые виды твердотопливных котлов' => new AttributeValue(null, [
        'традиционные' => 293,
    ]),
    'Длина полена' => new AttributeValue(294, null, function ($value) {
        return str_replace(['мм', ' ', ','], ['', '', '.'], $value);
    }),
    'Расход жидкого топлива' => new AttributeValue(295, null, function ($value) {
        return str_replace(['л/ч', ' ', ','], ['', '', '.'], $value);
    }),
    'Мощность на дизельном топливе' => new AttributeValue(296, null, function ($value) {
        return str_replace(['кВт', ' ', ','], ['', '', '.'], $value);
    }),
    'Мощность на твердом топливе' => new AttributeValue(297, null, function ($value) {
        return str_replace(['кВт', ' ', ','], ['', '', '.'], $value);
    }),
    'Мощность на электричестве' => new AttributeValue(298, null, function ($value) {
        return str_replace(['кВт', ' ', ','], ['', '', '.'], $value);
    }),
    'Змеевик ГВС (40°С)' => new AttributeValue(299, null, function ($value) {
        return str_replace(['л/мин', ' ', ','], ['', '', '.'], $value);
    }),
    'Вид оборудования' => new AttributeValue(null, [
        'газовое оборудование' => 300,
        'теплоноситель  для систем отопления' => 301,
        'мембранные расширительные баки' => 302,
        'коллекторные шкафы' => 303,
        'баки для воды' => 304,
        'прочее оборудование для котельных' => 305,
        'стабилизаторы сетевого напряжения' => 307,
        'насосные группы' => 306,
        'теплообменники' => 308,
        'буферные емкости' => 309,
        'источники бесперебойного питания' => 310,
        'топливные баки' => 311,
        'терморегуляторы' => 339,
        'нагревательные маты  кабельные' => 340,
        'комплектующие' => 342,
        'коврики с подогревом' => 341,
        'нагревательные маты пленочные' => 343,
        'нагревательные кабели' => 345,
        'нагревательные пленки' => 344,
        'тепловые завесы' => 346,
        'тепловые пушки' => 347,
        'тепловентиляторы' => 348,
        'электрические конвекторы' => 349,
        'электрические полотенцесушители' => 774,
        'фитинги резьбовые' => 312,
        'краны шаровые' => 313,
        'воздухоотводчики' => 314,
        'фильтры' => 315,
        'коллекторы для водоснабжения' => 316,
        'клапаны обратные' => 317,
        'гибкие подводки' => 318,
        'краны специальные' => 319,
        'клапаны электромагнитные' => 320,
        'редукторы давления' => 321,
        'клапаны смесительные ротационные' => 323,
        'клапаны предохранительные' => 322,
        'группы безопасности котлов' => 324,
        'клапаны термостатические смесительные' => 325,
        'группы безопасности бойлеров' => 326,
        'вентили' => 327,
        'клапаны балансировочные' => 328,
        'задвижки' => 329,
        'клапаны перепускные' => 330,
        'клапаны подпиточные' => 331,
        'сепараторы' => 332,
        'клапаны регулирующие' => 333,
        'компенсаторы антивибрационные' => 334,
        'затворы' => 335,
        'крепеж' => 336,
        'материалы' => 337,
        'инструменты' => 338,
    ]),
    'Вид газового оборудования' => new AttributeValue(null, [
        'фитинги для газовых труб' => 350,
        'газовые трубы' => 351,
        'газовая арматура' => 352,
    ]),
    'Вид фитингов для газовых труб' => new AttributeValue(null, [
        'муфты с переходом на ВР' => 353,
        'муфты с переходом на НР' => 354,
    ]),
    'Материал' => new AttributeValue(null, [
        'латунь' => 355,
        'нержавеющая сталь' => 356,
        'никелированная латунь' => 357,
        'сталь, латунь, EPP-Изоляция' => 358,
        'сталь' => 359,
        'сталь с лаковым покрытием, EPP-Изоляция' => 360,
        'конструкционная сталь' => 361,
        'Полиэтилен' => 365,
        'сталь, латунь' => 364,
        'полиэтилен' => 365,
        'черная сталь' => 362,
        'стальные' => 359,
        'алюминиевые' => 367,
        'биметаллические' => 368,
        'чугунные' => 382,
        'вспененный полипропилен' => 370,
        'из сшитого полиэтилена' => 371,
        'металлопластиковые' => 372,
        'полипропиленовые' => 373,
        'из ПНД' => 385,
        'медные' => 375,
        'теплоизолированные' => 376,
        'пластиковые' => 381,
        'АБС-пластик' => 378,
        'оцинкованная сталь' => 379,
        'латунь ЛС-59 с покрытием хромом' => 380,
        'пластик' => 381,
        'чугун' => 382,
        'Вспененный полиэтилен' => 383,
        'Оцинкованная сталь' => 379,
        'ПНД' => 385,
        'нержавеющая сталь А2' => 386,
        'Лён' => 387,
        'Тефлоновое покрытие' => 388,
        'пластмасса' => 381,
        'Пластик' => 381,
        'Пенополиэтилен с покрытием - алюминиевая фольга' => 391,
        'Алюминий' => 392,
    ]),
    'Соединение' => new AttributeValue(null, [
        'резьбовое' => 393,
    ]),
    'Резьба 1' => new AttributeValue(null, [
        '1/2 ″' => 394,
        '1 ″' => 395,
        '3/4 ″' => 396,
        '1 1/4 ″' => 397,
        '2 ″' => 398,
        '1 1/2 ″' => 399,
    ]),
    'Диаметр 1' => new AttributeValue(null, [
        '15 мм' => 400,
        '25 мм' => 401,
        '20 мм' => 402,
    ]),
    'Объем' => new AttributeValue(403, null, function ($value) {
        return str_replace(['л', ' ', ','], ['', '', '.'], $value);
    }),
    'Назначение' => new AttributeValue(null, [
        'для водоснабжения' => 408,
        'для отопления' => 409,
        'для внутренней канализации' => 410,
        'для наружной канализации' => 411,
    ]),
    'Давление' => new AttributeValue(412, null, function ($value) {
        return str_replace(['бар', ' ', ','], ['', '', '.'], $value);
    }),
    'Высота' => new AttributeValue(265, null, function ($value) {
        return str_replace(['мм', ' ', ','], ['', '', '.'], $value);
    }),
    'Ширина' => new AttributeValue(264, null, function ($value) {
        return str_replace(['мм', ' ', ','], ['', '', '.'], $value);
    }),
    'Глубина' => new AttributeValue(413, null, function ($value) {
        return str_replace(['мм', ' ', ','], ['', '', '.'], $value);
    }),
    'Максимальная рабочая температура' => new AttributeValue(404, null, function ($value) {
        return str_replace(['°C', '°', ' ', ','], ['', '', '', '.'], $value);
    }),
    'Минимальная рабочая температура' => new AttributeValue(405, null, function ($value) {
        return str_replace(['°C', '°', ' ', ','], ['', '', '', '.'], $value);
    }),
    'Внешний диаметр' => new AttributeValue(406, null, function ($value) {
        return str_replace(['мм', ' ', ','], ['', '', '.'], $value);
    }),
    'Толщина стенки' => new AttributeValue(407, null, function ($value) {
        return str_replace(['мм', ' ', ','], ['', '', '.'], $value);
    }),
    'Диаметр' => new AttributeValue(414, null, function ($value) {
        return str_replace(['мм', ' ', ','], ['', '', '.'], $value);
    }),
    'Вид газовой арматуры' => new AttributeValue(null, [
        'краны шаровые для газа' => 441,
    ]),
    'Тип ручки' => new AttributeValue(null, [
        'бабочка' => 442,
        'рычаг' => 443,
    ]),
    'Резьба 2' => new AttributeValue(null, [
        '1/2 ″' => 444,
        '1 ″' => 445,
        '3/4 ″' => 446,
        '1 1/4 ″' => 447,
        '2 ″' => 448,
        '1 1/2 ″' => 449,
    ]),
    'Диаметр подключения' => new AttributeValue(null, [
        '20 мм' => 415,
        '25 мм' => 416,
        '32 мм' => 417,
        '40 мм' => 418,
        '65 мм' => 419,
        '50 мм' => 420,
        '19 мм' => 421,
        '76 мм' => 422,
        '15 мм' => 423,
        '25x25 мм' => 424,
        '2&Prime; мм' => 426,
        '1 1/4&Prime; мм' => 428,
        '1 1/2&Prime; мм' => 427,
        '80 мм' => 425,
        '100 мм' => 429,
        '150 мм' => 430,
        '25.40 мм' => 431,
        '31.75 мм' => 432,
        '12.7 мм' => 433,
        '120 мм' => 434,
        '190 мм' => 435,
        '30 мм' => 436,
        '300 мм' => 439,
        '200 мм' => 438,
        '125 мм' => 437,
        '250 мм' => 440,
    ]),
    'Максимальная температура теплоносителя' => new AttributeValue(450, null, function ($value) {
        return str_replace(['°C', '°', ' ', ','], ['', '', '', '.'], $value);
    }),
    'Минимальная температура теплоносителя' => new AttributeValue(451, null, function ($value) {
        return str_replace(['°C', '°', ' ', ','], ['', '', '', '.'], $value);
    }),
    'Диаметр с изоляцией' => new AttributeValue(452, null, function ($value) {
        return str_replace(['мм', ' ', ','], ['', '', '.'], $value);
    }),
    'Диаметр без изоляции' => new AttributeValue(453, null, function ($value) {
        return str_replace(['мм', ' ', ','], ['', '', '.'], $value);
    }),
    'Температура эксплуатации максимальная' => new AttributeValue(454, null, function ($value) {
        return str_replace(['°C', '°', ' ', ','], ['', '', '', '.'], $value);
    }),
    'Температура эксплуатации минимальная' => new AttributeValue(455, null, function ($value) {
        return str_replace(['°C', '°', ' ', ','], ['', '', '', '.'], $value);
    }),
    'Минимальное входное напряжение' => new AttributeValue(456, null, function ($value) {
        return str_replace(['В', ' ', ','], ['', '', '.'], $value);
    }),
    'Конструкция' => new AttributeValue(null, [
        'панельные' => 457,
        'секционные' => 458,
        'трубчатые' => 459,
        'вертикальные' => 460,
        'горизонтальные' => 461,
        'универсальный монтаж' => 462,
        'станции биологической очистки' => 463,
        'септики' => 465,
        'станции биохимической очистки' => 464,
    ]),
    'Особые виды радиаторов' => new AttributeValue(null, [
        'Традиционные' => 466,
        'дизайн-радиаторы' => 467,
        'гигиенические' => 468,
    ]),
    'Масса' => new AttributeValue(469, null, function ($value) {
        return str_replace(['кг', ' ', ','], ['', '', '.'], $value);
    }),
    'Межосевое расстояние' => new AttributeValue(470, null, function ($value) {
        return str_replace(['мм', ' ', ','], ['', '', '.'], $value);
    }),
    'Емкость' => new AttributeValue(471, null, function ($value) {
        return str_replace(['л', ' ', ','], ['', '', '.'], $value);
    }),
    'Количество секций' => new AttributeValue(472, null, function ($value) {
        return str_replace([' ', ','], ['', '.'], $value);
    }),
    'Используемая энергия' => new AttributeValue(null, [
        'газовые' => 473,
        'косвенного нагрева' => 474,
        'комбинированные' => 475,
        'электрические' => 476,
    ]),
    'Способ установки' => new AttributeValue(null, [
        'настенные' => 479,
        'напольные' => 480,
        'встраиваемые' => 481,
    ]),
    'Материал внутреннего бака' => new AttributeValue(null, [
        'отсутствует' => 482,
        'стальной с эмалированным покрытием' => 484,
        'нержавеющая сталь' => 483,
        'биостеклофарфор' => 485,
    ]),
    'Максимальное рабочее давление' => new AttributeValue(486, null, function ($value) {
        return str_replace(['бар', ' ', ','], ['', '', '.'], $value);
    }),
    'Максимальная температура' => new AttributeValue(487, null, function ($value) {
        return str_replace(['°C', '°', ' ', ','], ['', '', '', '.'], $value);
    }),
    'Дымоход' => new AttributeValue(488, null, function ($value) {
        return str_replace(['мм', ' ', ','], ['', '', '.'], $value);
    }),
    'Длина' => new Switcher([
        new SwitchValue(function ($value) {
            return mb_strpos($value, 'мм') === false ? false : true;
        }, new AttributeValue(263, null, function ($value) {
            return str_replace(['мм', ' ', ','], ['', '', '.'], $value);
        })),
        new SwitchValue(function ($value) {
            return mb_strpos($value, 'м') === false ? false : true;
        }, new AttributeValue(775, null, function ($value) {
            return str_replace(['м', ' ', ','], ['', '', '.'], $value);
        }))
    ]),
    'Минимальное рабочее давление' => new AttributeValue(490, null, function ($value) {
        return str_replace(['бар', ' ', ','], ['', '', '.'], $value);
    }),
    'Мощность теплообменника' => new AttributeValue(489, null, function ($value) {
        return str_replace(['кВт', ' ', ','], ['', '', '.'], $value);
    }),
    'Суммарная мощность всех ТЭНов' => new AttributeValue(491, null, function ($value) {
        return str_replace(['кВт', ' ', ','], ['', '', '.'], $value);
    }),
    'Вид тэна' => new AttributeValue(null, [
        'мокрый ТЭН' => 492,
        'сухой ТЭН' => 493,
    ]),
    'Уровень шума' => new AttributeValue(null, [
        '46 дБ(А)' => 567,
        '45 дБ(А)' => 568,
        '52 дБ(А)' => 569,
        '53 дБ(А)' => 570,
        '54 дБ(А)' => 571,
        '57 дБ(А)' => 574,
        '56 дБ(А)' => 572,
        '55 дБ(А)' => 573,
        '63 дБ(А)' => 575,
        '60 дБ(А)' => 576,
        '62 дБ(А)' => 577,
        '64 дБ(А)' => 578,
        '65 дБ(А)' => 579,
        '67 дБ(А)' => 580,
        '51 дБ(А)' => 582,
        '50 дБ(А)' => 581,
        '61 дБ(А)' => 583,
        'традиционные' => 564,
        'бесшумные' => 565,
        'малошумные' => 566,
    ]),
    'Принцип работы' => new AttributeValue(null, [
        'водяные' => 514,
        'циркуляционные с мокрым ротором' => 503,
        'погружные' => 504,
        'самовсасывающие' => 505,
        'поверхностные' => 506,
        'циркуляционные с сухим ротором' => 507,
        'крыльчатый одноструйный сухоходный' => 508,
        'крыльчатый одноструйный' => 509,
        'универсальный одноструйный' => 510,
        'сухоходный' => 511,
        'крыльчатый многоструйный мокроходный' => 512,
        'крыльчатый многоструйный сухоходный' => 513,
    ]),
    'Применение' => new AttributeValue(null, [
        'для системы отопления' => 494,
        'для водоснабжения' => 495,
        'для канализации' => 496,
        'для водоотведения' => 497,
        'для отопления и водоснабжения' => 498,
        'для отопления' => 499,
        'для хол./для горячей воды' => 500,
        'для холодной воды' => 501,
        'для горячей воды' => 502,
    ]),
    'Особые виды насосов' => new AttributeValue(null, [
        'со ступенчатым регулированием скорости' => 515,
        'с электронным регулированием скорости' => 516,
        'установки для отвода сточных вод с фекалиями' => 517,
        'установки для отвода сточных вод без фекалий' => 518,
        'дренажные грязевые' => 519,
        'консольные' => 520,
        'бытовые установки для отвода сточных вод' => 521,
    ]),
    'Минимальная температура' => new AttributeValue(522, null, function ($value) {
        return str_replace(['°C', '°', ' ', ','], ['', '', '', '.'], $value);
    }),
    'Класс электрозащиты' => new AttributeValue(523),
    'Мощность двигателя' => new AttributeValue(524, null, function ($value) {
        return str_replace(['кВт', ' ', ','], ['', '', '.'], $value);
    }),
    'Максимальная производительность' => new AttributeValue(525, null, function ($value) {
        return str_replace(['м³/час', ' ', ','], ['', '', '.'], $value);
    }),
    'Напор' => new AttributeValue(526, null, function ($value) {
        return str_replace(['м', ' ', ','], ['', '', '.'], $value);
    }),
    'Монтажная длина' => new AttributeValue(527, null, function ($value) {
        return str_replace(['мм', ' ', ','], ['', '', '.'], $value);
    }),
    'Область использования' => new AttributeValue(null, [
        'повышения давления' => 528,
        'для отвода фекальных вод' => 529,
        'для скважин' => 531,
        'для отвода сточных вод' => 530,
        'насосные установки для водоснабжения' => 532,
        'для колодцев' => 533,
    ]),
    'Производительность' => new AttributeValue(527, null, function ($value) {
        return str_replace(['м³/сутки', ' ', ','], ['', '', '.'], $value);
    }),
    'Количество пользователей' => new AttributeValue(535),
    'Объем первой партии воды' => new AttributeValue(536, null, function ($value) {
        return str_replace(['л', ' ', ','], ['', '', '.'], $value);
    }),
    'Количество камер' => new AttributeValue(538),
    'Объем технического резервуара' => new AttributeValue(537, null, function ($value) {
        return str_replace(['м³', ' ', ','], ['', '', '.'], $value);
    }),
    'Марка материала' => new AttributeValue(null, [
        'PE-XA' => 539,
        'PE-RT-Al- PE-RT' => 542,
        'PP-R' => 540,
        'полиэтилен низкого давления (ПНД)' => 541,
        'из углеродистой стали' => 543,
        'неотожженные' => 545,
        'из нержавеющей стали' => 544,
        'отожженные' => 546,
        'PE-Xс-Al-PE-Xc' => 547,
        'PE-XC' => 548,
        'PE-RT' => 549,
    ]),
    'Изоляция' => new AttributeValue(null, [
        'без изоляции' => 550,
        'в теплоизоляции' => 551,
        'в защитном кожухе' => 552,
        'в теплоизоляции в защитном кожухе' => 553,
    ]),
    'Рабочее давление' => new AttributeValue(554, null, function ($value) {
        return str_replace(['бар', ' ', ','], ['', '', '.'], $value);
    }),
    'Коэффициент линейного расширения' => new AttributeValue(555, null, function ($value) {
        return str_replace([' ', ','], ['', '.'], $value);
    }),
    'Цвет покрытия' => new AttributeValue(null, [
        'красный' => 556,
        'серый' => 557,
        'белый' => 558,
    ]),
    'Минимальный радиус изгиба' => new AttributeValue(null, [
        '3 диаметра трубы' => 559,
        '5 диаметров трубы' => 560,
    ]),
    'Коэффициент теплопроводности' => new AttributeValue(561, null, function ($value) {
        return str_replace([' ', ','], ['', '.'], $value);
    }),
    'Поверхность трубы' => new AttributeValue(null, [
        'гладкая' => 562,
        'гофрированная' => 563,
    ]),
    'Разновидность материала' => new AttributeValue(null, [
        'полипропилен' => 584,
        'ПВХ' => 585,
    ]),
    'Тип присоединения' => new AttributeValue(null, [
        'раструбный' => 586,
        'безраструбный' => 587,
    ]),
    'Виды резьбовых фитингов' => new AttributeValue(null, [
        'ниппели' => 588,
        'удлинители' => 589,
        'ниппели переходные' => 590,
        'футорки' => 591,
        'заглушки' => 592,
        'переходники ВН' => 594,
        'угольники ВВ' => 593,
        'муфты' => 596,
        'угольники НВ' => 597,
        'тройники ВВ' => 595,
        'тройники переходные ВВ' => 598,
        'американки НР-ВР' => 599,
        'сгоны' => 600,
        'американки ВР' => 602,
        'контргайки' => 601,
        'крестовины' => 603,
        'штуцеры' => 604,
        'угольники НН' => 605,
        'тройники НН' => 606,
        'угольники с креплением' => 607,
    ]),
    'Резьба R1' => new AttributeValue(null, [
        '1' => 608,
        '1/2' => 609,
        '3' => 610,
        '4' => 611,
        '2' => 612,
        '1/4' => 613,
        '1/8' => 614,
        '3/4' => 615,
        '3/8' => 616,
        '1 1/2' => 617,
        '1 1/4' => 618,
        '2 1/2' => 619,
        '2 1/4' => 621,
        '2 3/4' => 620,
        '1 3/4' => 622,
        '1 1/4″' => 776,
        '25' => 623,
    ]),
    'Резьба R2' => new AttributeValue(null, [
        '1' => 624,
        '1/2' => 625,
        '3' => 626,
        '4' => 627,
        '2' => 628,
        '1/4' => 629,
        '1/8' => 630,
        '3/4' => 631,
        '3/8' => 632,
        '1 1/2' => 633,
        '1 1/4' => 634,
        '2 1/2' => 635,
        '25' => 636,
    ]),
    'Резьба R3' => new AttributeValue(null, [
        '1/4' => 637,
        '3/8' => 645,
        '1/2' => 640,
        '3/4' => 639,
        '1 1/2' => 643,
        '1 1/4' => 638,
        '1' => 641,
        '2' => 642,
        '2 1/2' => 644,
        '4' => 646,
        '3' => 647,
        '40' => 648,
    ]),
    'Количество выходов' => new AttributeValue(null, [
        '2 шт' => 649,
        '3 шт' => 650,
        '4 шт' => 651,
    ]),
    'Диаметр D1' => new AttributeValue(652, null, function ($value) {
        return str_replace(['мм', ' ', ','], ['', '', '.'], $value);
    }),
    'Способ присоединения' => new AttributeValue(null, [
        'резьбовое присоединение' => 653,
        'сварное присоединение' => 655,
        'фланцевое присоединение' => 654,
        'межфланцевое присоединение' => 656,
    ]),
    'Принцип действия' => new AttributeValue(null, [
        'НЗ' => 657,
        'НО' => 658,
    ]),
    'Kvs' => new AttributeValue(659, null, function ($value) {
        return str_replace(['м³/ч', ' ', ','], ['', '', '.'], $value);
    }),
    'Вид резьбы' => new AttributeValue(null, [
        'Внутренняя-внутренняя' => 660,
        'Внутренняя' => 665,
        'Наружная-наружная' => 662,
        'Наружная' => 664,
        'наружная' => 664,
        'внутренняя' => 665,
    ]),
    'Материал уплотнения' => new AttributeValue(null, [
        'EPDM' => 666,
        'Этилен-пропиленовый каучук' => 667,
        'тефлон' => 668,
    ]),
    'Диаметр D2' => new AttributeValue(669, null, function ($value) {
        return str_replace(['мм', ' ', ','], ['', '', '.'], $value);
    }),
    'Диаметр D3' => new AttributeValue(670, null, function ($value) {
        return str_replace(['мм', ' ', ','], ['', '', '.'], $value);
    }),
    'Материал пружины' => new AttributeValue(null, [
        'нержавеющая сталь' => 671,
        'сталь' => 672,
    ]),
    'Температура открытия' => new AttributeValue(673, null, function ($value) {
        return str_replace(['°C', '°', ' ', ','], ['', '', '', '.'], $value);
    }),
    'Группа оборудования' => new AttributeValue(null, [
        'автоматика' => 675,
        'Контрольно-измерительные приборы' => 674,
    ]),
    'Подгруппа оборудования' => new AttributeValue(null, [
        'контроллеры' => 677,
        'манометры' => 676,
        'термометры' => 678,
        'термостаты' => 679,
        'GSM сигнализации' => 681,
        'термоманометры' => 682,
        'приводы' => 680,
        'счетчики' => 683,
        'радиотермостаты' => 684,
        'сервоприводы' => 685,
        'система защиты от протечек' => 687,
        'радиоконтроллеры' => 686,
        'реле' => 689,
        'системы подогрева труб' => 688,
        'регуляторы' => 690,
        'шпильки для хомутов' => 691,
        'дюбеля' => 692,
        'теплоизоляция' => 693,
        'хомуты' => 695,
        'клипсы' => 694,
        'гофры' => 696,
        'болты' => 697,
        'шайбы' => 698,
        'гайки' => 699,
        'анкера' => 700,
        'уплотнительные материалы' => 701,
        'саморезы' => 702,
        'штанги резьбовые' => 703,
        'ленты перфорированные' => 704,
        'материалы для пайки' => 705,
        'инструменты для монтажа труб' => 706,
        'ленты самоклеющиеся' => 707,
        'труборезы' => 708,
        'инструмент для гибки труб' => 709,
        'калибраторы для труб' => 710,
        'инструмент для пайки' => 711,
        'монтажные ключи' => 712,
        'клеи, очистители' => 713,
        'гидропрессы' => 714,
    ]),
    'Присоединение' => new AttributeValue(null, [
        'радиальный' => 715,
        'аксиальный' => 716,
    ]),
    'Цвет корпуса' => new AttributeValue(null, [
        'черный' => 717,
        'металлический' => 718,
        'белый' => 719,
        'оранжевый' => 720,
        'серый' => 721,
    ]),
    'Класс защиты (IP)' => new AttributeValue(722),
    'Стекло' => new AttributeValue(null, [
        'инструментальное' => 723,
        'акриловое' => 724,
    ]),
    'Диапазон измерения давления' => new AttributeValue(null, [
        '0-6 бар' => 725,
        '0-10 бар' => 726,
        '0-16 бар' => 727,
        '0-4 бар' => 728,
        '0-2,5 бар' => 729,
        '0-40 бар' => 730,
    ]),
    'Диапазон измерения температур' => new AttributeValue(null, [
        '0-120 °С' => 732,
        '0-160 °С' => 731,
    ]),
    'Разновидность подгруппы оборудования' => new AttributeValue(null, [
        'капиллярные' => 733,
        'комнатные термостаты' => 734,
        'накладные термостаты' => 736,
        'счетчики воды' => 735,
        'термостаты биметаллические' => 737,
        'погружные термостаты' => 738,
        'датчики протечки воды' => 740,
        'термостаты в корпусе' => 739,
        'комплектующие для счетчиков' => 741,
        'краны шаровые с электроприводом' => 742,
        'готовые комплекты' => 743,
        'модули управления' => 744,
        'регуляторы давления' => 745,
        'реле температуры' => 746,
        'дополнительная арматура' => 747,
        'регуляторы температуры' => 748,
        'комплектующие для манометров и термометров' => 749,
        'счетчики тепла' => 750,
        'металлопластиковых труб' => 751,
        'для металлопластиковых труб' => 751,
        'для полипропиленовых труб' => 756,
        'труб из сшитого полиэтилена' => 754,
        'для медных труб' => 755,
        'полипропиленовых труб' => 756,
        'для нержавеющей стали' => 757,
    ]),
    'Питание' => new AttributeValue(null, [
        '2 В' => 758,
        '4 В' => 759,
        '230 В' => 760,
        '24 В' => 761,
        '9 В' => 762,
        '5 В' => 763,
    ]),
    'Тип установки' => new AttributeValue(null, [
        'встраиваемый' => 764,
        'накладной' => 765,
    ]),
    'Номинальное напряжение' => new AttributeValue(null, [
        '12 В' => 766,
        '220 В' => 767,
        '16 В' => 768,
        '3 В' => 769,
    ]),
    'Способ передачи сигнала' => new AttributeValue(null, [
        'проводной' => 770,
        'беспроводной' => 771,
    ]),
    'Номинальный расход' => new AttributeValue(777, null, function ($value) {
        return str_replace(['м³/ч', ' ', ','], ['', '', '.'], $value);
    }),
    'Максимальный расход' => new AttributeValue(778, null, function ($value) {
        return str_replace(['м³/ч', ' ', ','], ['', '', '.'], $value);
    }),
    'Цвет' => new AttributeValue(null, [
        'Серый' => 779,
        'Синий' => 780,
        'Красный' => 781,
        'Бежевый' => 782,
        'светло-серый' => 783,
        'синий' => 784,
        'серый' => 785,
        'бежевый' => 786,
        'Металлический' => 787,
        'Белый' => 788,
        'Металлик' => 789,
        'красный' => 790,
    ]),
];